Revit 2024 API
BuiltInFailures.ImportFailures.WorksetCreatedForLinkWarning Property
 Newly created link types and instances were placed in new workset [workset name]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WorksetCreatedForLinkWarning { get; }
Visual Basic
Public Shared ReadOnly Property WorksetCreatedForLinkWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WorksetCreatedForLinkWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace